In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 6, 12), datetime.date(2023, 6, 11))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 6, 12), datetime.date(2023, 6, 11))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(2)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-06-12
Today in mm-dd format: 06-12
yesterday: 2023-06-08 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-06-08 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1    JASIF  130000
1       1      MCS   78000
2       1    PTTGC    6000
3       1      TMT   36000
4       2      ASK    4500
5       2      ASP   30000
6       2    BANPU   30000
7       2  CPNREIT   60000
8       2      DIF   30000
9       2   GVREIT   30000
10      2      NER   32000
11      2      ORI   45000
12      2      RCL   27000
13      2     SENA  105000
14      2      STA    5000
15      2    TFFIF   20000
16      2    WHAIR   50000
17      2    WHART   30000
18      3      IVL    7200
19      3      JMT    4200
20      3      SCC     600
21      4       AH    1200
22      4      BCH   15000
23      4    JMART    6000
24      4      KCE   10000
25      4   SINGER    6000
26      4    SYNEX   15000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-06-12'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1      JASIF     130000   22-12-30   23-06-12       8.05       6.95      -1.10     -13.66 -143,000.00        -22
         1        MCS      78000   22-12-30   23-06-12       8.95       7.00      -1.95     -21.79 -152,100.00        -39
         1      PTTGC       6000   22-12-30   23-06-12      47.25      38.25      -9.00     -19.05 -54,000.00        -36
         1        TMT      36000   22-12-30   23-06-12       7.80       7.45      -0.35      -4.49 -12,600.00         -7
         2        ASK       4500   22-12-30   23-06-12      35.50      27.50      -8.00     -22.54 -36,000.00        -32
         2        ASP      30000   22-12-30   23-06-12       2.98       2.84      -0.14      -4.70  -4,200.00         -7
         2      BANPU      30000   22-12-30   23-06-12      13.70       8.75      -4.95     -36.13 -148,500.00        -62
         2    CPNREIT      60000   22-12-30   23-06-12      19.50      12.90      -6.60     -33.85 -396,000.00        -66
         2        DIF      30000   22-12-30   23-06-12      13.20      12.30      -0.90      -6.82 -27,000.00         -9
         2     GVREIT      30000   22-12-30   23-06-12       9.10       9.00      -0.10      -1.10  -3,000.00         -2
         2        NER      32000   22-12-30   23-06-12       6.35       4.68      -1.67     -26.30 -53,440.00        -43
         2        ORI      45000   22-12-30   23-06-12      12.10      11.10      -1.00      -8.26 -45,000.00        -10
         2        RCL      27000   22-12-30   23-06-12      30.75      24.40      -6.35     -20.65 -171,450.00        -29
         2       SENA     105000   22-12-30   23-06-12       3.94       3.16      -0.78     -19.80 -81,900.00        -39
         2        STA       5000   22-12-30   23-06-12      21.10      18.50      -2.60     -12.32 -13,000.00        -26
         2      TFFIF      20000   22-12-30   23-06-12       7.65       7.60      -0.05      -0.65  -1,000.00         -1
         2      WHAIR      50000   22-12-30   23-06-12       7.45       7.25      -0.20      -2.68 -10,000.00         -4
         2      WHART      30000   22-12-30   23-06-12      10.70      11.20       0.50       4.67  15,000.00          5
         3        IVL       7200   22-12-30   23-06-12      40.75      33.50      -7.25     -17.79 -52,200.00        -29
         3        JMT       4200   22-12-30   23-06-12      69.00      43.25     -25.75     -37.32 -108,150.00       -103
         3        SCC        600   22-12-30   23-06-12     342.00     332.00     -10.00      -2.92  -6,000.00        -10
         4         AH       1200   22-12-30   23-06-12      29.75      35.25       5.50      18.49   6,600.00         22
         4        BCH      15000   22-12-30   23-06-12      20.50      18.40      -2.10     -10.24 -31,500.00        -21
         4      JMART       6000   22-12-30   23-06-12      40.75      19.90     -20.85     -51.17 -125,100.00       -114
         4        KCE      10000   22-12-30   23-06-12      46.50      39.25      -7.25     -15.59 -72,500.00        -29
         4     SINGER       6000   22-12-30   23-06-12      28.75      11.10     -17.65     -61.39 -105,900.00       -154
         4      SYNEX      15000   22-12-30   23-06-12      16.40      13.20      -3.20     -19.51 -48,000.00        -32

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
5,2,ASP,30000,2022-12-30,2023-06-12,2.98,2.84,-0.14,-4.70,-4200.0,-7
23,4,JMART,6000,2022-12-30,2023-06-12,40.75,19.90,-20.85,-51.17,-125100.0,-114
15,2,TFFIF,20000,2022-12-30,2023-06-12,7.65,7.60,-0.05,-0.65,-1000.0,-1
8,2,DIF,30000,2022-12-30,2023-06-12,13.20,12.30,-0.90,-6.82,-27000.0,-9
9,2,GVREIT,30000,2022-12-30,2023-06-12,9.10,9.00,-0.10,-1.10,-3000.0,-2

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
0,1,JASIF,130000,2022-12-30,2023-06-12,8.05,6.95,-1.10,-13.66,-143000.0,-22
24,4,KCE,10000,2022-12-30,2023-06-12,46.50,39.25,-7.25,-15.59,-72500.0,-29
12,2,RCL,27000,2022-12-30,2023-06-12,30.75,24.40,-6.35,-20.65,-171450.0,-29
2,1,PTTGC,6000,2022-12-30,2023-06-12,47.25,38.25,-9.00,-19.05,-54000.0,-36
6,2,BANPU,30000,2022-12-30,2023-06-12,13.70,8.75,-4.95,-36.13,-148500.0,-62

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
25,4,SINGER,6000,2022-12-30,2023-06-12,28.75,11.10,-17.65,-61.39,-105900.0,-154
7,2,CPNREIT,60000,2022-12-30,2023-06-12,19.50,12.90,-6.60,-33.85,-396000.0,-66
26,4,SYNEX,15000,2022-12-30,2023-06-12,16.40,13.20,-3.20,-19.51,-48000.0,-32
16,2,WHAIR,50000,2022-12-30,2023-06-12,7.45,7.25,-0.20,-2.68,-10000.0,-4
9,2,GVREIT,30000,2022-12-30,2023-06-12,9.10,9.00,-0.10,-1.10,-3000.0,-2

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change    amount  spd
period
1       250000   72.05   59.65  -12.40   -58.99 -361700.0 -104
2       498500  194.02  161.18  -32.84  -191.13 -975490.0 -325
3        12000  451.75  408.75  -43.00   -58.03 -166350.0 -142
4        53200  182.65  137.10  -45.55  -139.41 -376400.0 -328

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr      avr_p1      avr_p2    avr_chg    avr_spd   ttl_amt
period
1        250000   18.012500   14.912500  -3.100000 -26.000000 -361700.0
2        498500   13.858571   11.512857  -2.345714 -23.214286 -975490.0
3         12000  150.583333  136.250000 -14.333333 -47.333333 -166350.0
4         53200   30.441667   22.850000  -7.591667 -54.666667 -376400.0

In [17]:
pl = df.amount.sum()
pl

-1879940.0

In [18]:
prev_pl = -1_867_555
diff = pl - prev_pl
diff

-12385.0